/*============================================================================
*
*  版权(R)所有  2003-2014 沈晓峰. All Rights Reserved.
*
*  【文件名】:          config.h 
*  【版本】：           （必需）
*  【功能模块和目的】:  （必需）
*				
*  【开发者】:          Xiaofeng Shen（gray.shen@starxnet.com）-i
*  【制作日期】:        2014/03/17 03:22:53 - 2014/03/17 03:22:53
*  【更改记录】:        （若修改过则必需注明）
*
*============================================================================*/

/* 防止头文件重复定义或包含 --------------------------------------------------*/
#ifndef _CONFIG_H
#define _CONFIG_H

#pragma once

#endif /* _CONFIG_H */

/****************************** END OF FILE ********************************/
