/*============================================================================
*
*  版权(R)所有  2003-2014 沈晓峰. All Rights Reserved.
*
*  【文件名】:          sysdeps_linux.c 
*  【版本】：           （必需）
*  【功能模块和目的】:  （必需）
*				
*  【开发者】:          沈晓峰（gray.shen@starxnet.com）
*  【制作日期】:        2014/03/16 14:12:03 - 2014/03/16 14:12:03
*  【更改记录】:        （若修改过则必需注明）
*
*============================================================================*/

/* 包含头文件 ----------------------------------------------------------------*/
#include <sys/types.h> 
#include <unistd.h>
#include <limits.h>
#include <stdio.h>

/* 私有定义类型 --------------------------------------------------------------*/

/* 私有定义常量 --------------------------------------------------------------*/

/* 私有定义宏 ----------------------------------------------------------------*/

/* 私有全局变量 --------------------------------------------------------------*/

/* 私有函数 ------------------------------------------------------------------*/

void GetAppFullPath(char *exe, size_t maxLen)
{
    char proc[64];
    snprintf(proc, sizeof proc, "/proc/%d/exe", getpid());
    int err = readlink(proc, exe, maxLen - 1);
    if(err > 0) {
        exe[err] = '\0';
    } else {
        exe[0] = '\0';
    }
}

void GetAppPath(char *exe, size_t maxLen)
{
  char proc[64];
  snprintf(proc, sizeof proc, "/proc/%d/exe", getpid());
  int cnt = readlink(proc, exe, maxLen - 1);
  if(cnt > 0) {
    exe[cnt] = '\0';
    for (int i = cnt; i >= 0; --i)    
    {    
      if (exe[i] == '/')    
      {    
        exe[i + 1] = '\0';    
        break;    
      }    
    }      
  } else {
    exe[0] = '\0';
  }
}


/******************************* END OF FILE *********************************/
