/*============================================================================
*
*  版权(R)所有  2003-2014 沈晓峰. All Rights Reserved.
*
*  【文件名】:          utility.h
*  【版本】：           （必需）
*  【功能模块和目的】:  （必需）
*				
*  【开发者】:          沈晓峰（gray.shen@starxnet.com）
*  【制作日期】:        2014/03/16 15:58:42 - 2014/03/16 15:58:42
*  【更改记录】:        （若修改过则必需注明）
*
*============================================================================*/

/* 防止头文件重复定义或包含 --------------------------------------------------*/
#ifndef _UTILITY_H
#define _UTILITY_H

#pragma once

#ifdef __cplusplus
extern "C" {
#endif
/* 包含头文件 --------------------------------------------------------------*/
#include <stdbool.h>
#include "gsDef.h"
  
/* 导出定义类型 ------------------------------------------------------------*/

/* 导出定义常量 ------------------------------------------------------------*/

/* 导出定义宏 --------------------------------------------------------------*/

/* 导出变量 ----------------------------------------------------------------*/

/* 导出函数原型 ------------------------------------------------------------*/
static __inline__
bool isNullField(IN const char * pStr) {
  if (pStr == NULL || !strlen((const char *)pStr))
    return true;
  return false;
} 

#ifdef __cplusplus
}
#endif

#endif /* _UTILITY_H */

/****************************** END OF FILE ********************************/
